## Python Pandas Excel 学习群: 366719470
## Ask And Answer 问答
## AAA008 索引对齐相减

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame([
    ['c', 3],
    ['a', 2],
    ['b', 7],
    ['d', 6]
], columns=['A', 'B'])

In [3]:
df2 = pd.DataFrame([
    ['b', 5],
    ['c', 3],
    ['d', 9],
    ['e', 1],
    ['f', 8]
], columns=['A', 'B'])

In [16]:
(df1.set_index('A') - df2.set_index('A')).reset_index()

   A    B
0  a  NaN
1  b  2.0
2  c  0.0
3  d -3.0
4  e  NaN
5  f  NaN

In [5]:
df2

   A  B
0  b  5
1  c  3
2  d  9
3  e  1
4  f  8

In [6]:
s1 = df1.set_index('A')['B']
s1

A
c    3
a    2
b    7
d    6
Name: B, dtype: int64

In [7]:
s2 = df2.set_index('A')['B']
s2

A
b    5
c    3
d    9
e    1
f    8
Name: B, dtype: int64

In [14]:
s3 = s1 - s2
s3.to_frame().reset_index()

   A    B
0  a  NaN
1  b  2.0
2  c  0.0
3  d -3.0
4  e  NaN
5  f  NaN

In [9]:
df3 = pd.concat([s1, s2, s3], axis=1)
df3

     B    B    B
c  3.0  3.0  0.0
a  2.0  NaN  NaN
b  7.0  5.0  2.0
d  6.0  9.0 -3.0
e  NaN  1.0  NaN
f  NaN  8.0  NaN

In [10]:
df3 = df3.reset_index()
df3

  index    B    B    B
0     c  3.0  3.0  0.0
1     a  2.0  NaN  NaN
2     b  7.0  5.0  2.0
3     d  6.0  9.0 -3.0
4     e  NaN  1.0  NaN
5     f  NaN  8.0  NaN

In [11]:
df3.columns=['A', 'B1', 'B2', 'B3']
df3

   A   B1   B2   B3
0  c  3.0  3.0  0.0
1  a  2.0  NaN  NaN
2  b  7.0  5.0  2.0
3  d  6.0  9.0 -3.0
4  e  NaN  1.0  NaN
5  f  NaN  8.0  NaN

In [12]:
df3 = df3.sort_values('A')
df3

   A   B1   B2   B3
1  a  2.0  NaN  NaN
2  b  7.0  5.0  2.0
0  c  3.0  3.0  0.0
3  d  6.0  9.0 -3.0
4  e  NaN  1.0  NaN
5  f  NaN  8.0  NaN